fe32/tutorials/rheoInterFoam/ImpactingDrop/Oldroyd-BLog/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

setFormat raw;

surfaceFormat raw;

formatOptions
{
    ensight
    {
        format  ascii;
    }
}

interpolationScheme cellPointFace;

fields
(
   U
   tau
   theta
);

sets
(
    lineVert_x0.5
    {
        type        face;
        axis        y;

        start       ( 0.5 -0.1 0.);
        end         ( 0.5 1.1 0. );         
    }

    lineHorz_y0.75
    {
        type        face;
        axis        x;

        start       ( -0.1 0.75 0.);
        end         ( 1.1 0.75 0. );         
    }
     
 
);

